InformationRegisters/Инфотек_ОбращенияCRM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Инфотек_ОбращенияCRM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МастерКонсультант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инфотек_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Инфотек_СтатусыОбращений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Инфотек_СтатусыОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Инфотек_СтатусыОбращений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВзятВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПредварительномОтказе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОтказе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершён</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удален</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/Инфотек_ОбращенияCRM/Forms/ФормаКомментария/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// Модуль формы комментария регистра "Обращения CRM"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийЭлементовФормы  

&НаКлиенте
Процедура КомментарийОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Список = ПолучитьСписокКомментариевПоПодстроке(Текст);
	Если Список.Количество() = 0 Тогда         
		Комментарий = Текст;
		Возврат;
	КонецЕсли;
	
	ВыбранныйЭлемент = ВыбратьИзСписка(Список,Элемент);	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Комментарий = ВыбранныйЭлемент.Значение;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКомментариевПоПодстроке(ПодстрокаПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инфотек_Комментарии.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Инфотек_Комментарии КАК Инфотек_Комментарии
	|ГДЕ
	|	Инфотек_Комментарии.Комментарий ПОДОБНО &ПодстрокаПоиска";
	Запрос.УстановитьПараметр("ПодстрокаПоиска", "%" + ПодстрокаПоиска + "%");
	
	Список = Новый СписокЗначений;	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Список.Добавить(СокрЛП(Выборка.Ссылка.Комментарий));
	КонецЦикла;
		
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.Инфотек_Комментарии.Форма.ФормаВыбора",ПараметрыФормы,,,,, Новый ОписаниеОповещения("КомментарийНачалоВыбораЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры
  
&НаКлиенте
Процедура КомментарийНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатОткрытия = Результат;
	
	Если РезультатОткрытия = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ОбработатьРезультатНаСервере(РезультатОткрытия);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатНаСервере(РезультатОткрытия)

	Комментарий = РезультатОткрытия.Комментарий;

КонецПроцедуры
	
	
#КонецОбласти

#Область ОбработчикиСобытийКомандФормы  

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)  
	
	ЗаписатьИзмененияНаСервере();   
	ЭтаФорма.Закрыть();	

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере() 
	
	МенеджерЗаписи = РегистрыСведений.Инфотек_ОбращенияCRM.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Параметры.Идентификатор;
	МенеджерЗаписи.НастройкаПодключения = Параметры.НастройкаПодключения;  
	МенеджерЗаписи.Статус = Параметры.Статус;
	МенеджерЗаписи.Прочитать();   
	Если МенеджерЗаписи.Выбран() Тогда  
		Если МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.НеВзятВРаботу Тогда
			Инфотек_ИнтеграцияCRM.ВзятьОбращениеВРаботу(МенеджерЗаписи,Параметры.НастройкаПодключения);
		КонецЕсли;
		МенеджерЗаписи.Комментарий = Комментарий;    
		Если Параметры.Отмена = Истина Тогда
			МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.ВОтказе;
		Иначе
			МенеджерЗаписи.Статус = Перечисления.Инфотек_СтатусыОбращений.Завершён; 
		КонецЕсли;	
		МенеджерЗаписи.Записать();
	КонецЕсли;  
	Если Параметры.Отмена = Истина Тогда 
		Инфотек_ИнтеграцияCRM.ЗавершитьОбращениеОтменой(МенеджерЗаписи,Параметры.НастройкаПодключения);
	Иначе
		Инфотек_ИнтеграцияCRM.ЗавершитьОбращениеКонсультацией(МенеджерЗаписи,Параметры.НастройкаПодключения);
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти
